music_web_app/app/models/user.rb

  def self.find_by_credentials(email_address, password)
    user = User.find_by(email_address: email_address)
---
SELECT  "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "nerochen25@gmail.com"], ["LIMIT", 1]]