music_web_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "coldplay"], ["created_at", "2018-11-16 00:48:05.728094"], ["updated_at", "2018-11-16 00:48:05.728094"]]
---
  def create
    @band = Band.new(band_params)
    @band.user_id = current_user.id
    if @band.save